{
    "asaro": {
        "Ingredients": [
            "2 lbs White yam tuber",
            "5 cups Water",
            "2 large Red bell pepper",
            "3 Roma Tomatoes",
            "1 Habanero pepper (plus more if you like it spicy)",
            "1 Medium red onion",
            "1 cup Pure red palm oil (unrefined)",
            "½ cup ground Crayfish (divided)",
            "1 seasoning cube or a teaspoon of seasoning powder",
            "3 medium whole Dry fish",
            "5 oz Fresh or frozen Amaranth greens (kale or spinach is fine)"
        ],
        "Instructions": [
            "Cut the yam in half and peel it from top to bottom. Then cut the yam in half, lengthwise, and do the same for the other half. Cut the half into 3 pieces or quarters. Repeat the step for the rest of the yam.",
            "Rinse the yam under running water, place it into a large non-stick pot with enough water to cover the top, and season with salt.",
            "Place the bell peppers, habanero, and onion in the bowl of a food processor, then pulse until it’s roughly combined. Add the pepper mix, seasoning cube, and half of the crayfish into the pot with yam. Cover the pot loosely and cook on medium-high heat for 15 minutes.",
            "Meanwhile, separate the head of the fish from the body and clean it under running water, making sure to remove any bones and gunk. Pluck, wash, and roughly chop the amaranth leaves and set them aside.",
            "Add the dry fish, palm oil, and the remaining crayfish into the pot with the yam, then stir to combine. Adjust for taste. Cover and cook for 5 minutes.",
            "Lift a piece of yam with a spoon. Check to see if the yam is soft to the touch. Use a fork or masher to mash one or two, then place them back into the pot. This helps thicken the porridge.",
            "Add the leaves and stir to combine. Adjust taste. Cover and cook for 2 minutes or until the leaves soften (it will take less time for spinach). Remove from heat. Serve immediately."
        ]
    },
    "eforiro": {
        "Ingredients": [
            "24 oz chopped frozen spinach (680g)",
            "24 oz chopped frozen kale (680g)",
            "1 tablespoon Iru (locust bean), thoroughly rinsed",
            "1 cup fish shred, washed and boned (optional, I used kini fish)",
            "1 lb cooked meat of choice (a combination of goatmeat, cow skin, tripe, or shrimp can be used)",
            "3 tablespoons ground crayfish",
            "4 oz thin tomato paste",
            "½ cup palm oil",
            "½ medium onion",
            "3 sweet pepper (optional)",
            "3 red bell peppers",
            "2 garlic cloves",
            "1 teaspoon fresh minced ginger (optional)",
            "2 habanero peppers",
            "2 tablespoons chicken bouillon powder (or 1 stock cube)",
            "Salt to taste"
        ],
        "Instructions": [
            "Add the peppers, onion, garlic, and ginger into a food processor. Pulse about 3 to 4 times until roughly chopped.",
            "Add the palm oil to a saucepan over medium-high heat. Once it’s hot, carefully add the pepper mixture and iru. Fry for about 7-10 minutes, often stirring to avoid burning.",
            "Add the seasoning cube, salt, crayfish, and fish shreds. Stir to combine. Cover loosely and simmer on medium-low heat for 3 minutes.",
            "Meanwhile, run your frozen vegetable under cold running water until thawed. Squeeze out any excess water from the vegetable.",
            "Add the vegetable and combine with the sauce. Allow to simmer uncovered for about 4 minutes, adjust taste and remove from heat.",
            "The soup is ready to serve. Store remaining soup in a food storage container in the refrigerator for up to 2 days or freeze for 2-3 weeks. PS: If you don’t want to run the vegetable underwater, add it directly to the soup. Make sure to skip adding water or stock as mentioned earlier, else, the soup will be watery."
        ]
    },
    "ekuru": {
        "Ingredients": [
            "White peeled beans",
            "Little water",
            "Grated bell pepper",
            "Locust Bean",
            "Palm oil",
            "Diced pomo",
            "Stock fish or dry panla",
            "Diced meat",
            "Diced chicken"
        ],
        "Instructions": [
            "Blend the peeled beans with a little water till semi-smooth. The consistency should be not too watery and not too thick.",
            "With a hand mixer, incorporate air into the bean batter for 10 minutes.",
            "Mix till fluffy and frothy. Scoop the batter into moinmoin leaves and cook in a pot till cooked.",
            "Place a pot on fire and pour in your palm oil. Allow it to heat.",
            "Add locust beans and fry for some minutes. Add grated pepper, tomatoes, tomato paste, and locust beans, then leave till done.",
            "Add Maggi, salt, and your proteins. Stir together and allow it to cook. Note: do not add too much water and there should be enough palm oil because it stands as water."
        ]
    },
    "ewagoyin": {
        "Ingredients": [
            "3 cups Black Eyed Beans",
            "300ml Palm Oil",
            "8-10 Pieces Dried Bell Peppers (Tatashe gbigbe)",
            "1 Medium Size Red Onion",
            "2-3 Pieces Cameroon Pepper",
            "3 Heaped Tablespoons Dried Pepper Seeds",
            "1 Tablespoon Ground Pepper (Atagungun)",
            "1/2 Teaspoon Minced Ginger",
            "2 Tablespoons Dried whole crayfish or 1/2 cup smoked fish (optional)",
            "1 Maggi Crayfish (optional)",
            "Salt to taste"
        ],
        "Instructions": [
            "Soak your dried peppers in water till they’re plump, this should take between 2-6 hours, depending on just how dry they are. You can choose to soak overnight if you wish.",
            "When the peppers are plump, add the pepper seeds and just a little bit of water (you can use some of the water they were soaked in, half a cup should do). Add the minced ginger, crayfish and Maggi crayfish, blend coarsely.",
            "If you don’t like tasting bits in your stews, you can blend smoother. Set the blended pepper aside.",
            "Pick and wash your beans, pour in enough water to cover and cook till tender (do not add any salt till it’s tender). This is so the beans cook faster. To cut down cooking time, use a pressure cooker if you have one.",
            "While the beans are cooking, get a saucepan, place on a hob on medium heat, add the palm oil and bleach for 10-12 minutes.",
            "When it’s bleached, turn the heat down to low, add your chopped onions. Fry the onions till it begins to burn a little.",
            "Now add your blended pepper, ground pepper, smoked fish (if you’re using any) and salt to taste. Still on low heat, let it fry for at least 40 minutes, stir occasionally so it doesn’t burn.",
            "Check on the beans, when it’s tender, add salt to taste. Let it continue to boil till very soft.",
            "When it’s very soft, use a wooden spoon to mash the beans till there’s almost no whole beans in sight. Alternatively, mash it up using a hand mixer."
        ]
    },
    "moimoi": {
        "Ingredients": [
            "1½ Cups dry beans (Black eyed Peas or Brown Beans-'Ewa Oloyin')",
            "1 Red Bell pepper/Tatashe (Medium size)",
            "1 Habanero/scotch Bonnet/Rodo",
            "¾ Cup Diced onion",
            "2 Tablespoons Crayfish",
            "¼ Cup Vegetable Oil",
            "2 Bullion Cubes",
            "¾ Cup cooked minced Fish",
            "3 Hard boiled Eggs",
            "Salt to taste"
        ],
        "Instructions": [
            "Soak the Beans for 15 minutes depending on how dry your beans are. The drier beans tend to be ready for peeling faster than the less dried beans.",
            "Pour the Beans in the Blender and add twice as much water as the Beans (by volume) blend the Beans for 3-4 seconds per time and repeat this 3 to 4 times – Remember we are peeling the beans and not blending them.",
            "Pour the beans back into a large bowl and add enough water to fully cover the Beans. Now agitate the Beans with your fingers and the skin will float then quickly separate the skin from the Beans by pouring through a sieve.",
            "Once that is done, pour the peeled Beans (the skinless Beans) inside a Blender, together with the Red Pepper, Habanero, and Onion – Blend to the smoothest consistency you can ever get.",
            "Combine the blended mixture with the remaining ingredients except for the boiled Eggs.",
            "Spray or brush the container you will be using with oil. Pour the mixture into the container and place the boiled egg over it. Cover it with a lid or seal with foil paper.",
            "Line the base of a large pot with either foil paper, sticks, leaves. Add enough water to the pot. (Add just enough not to submerge the moi moi bowls). This is to prevent the Moin moin from sticking to the base of the pot in case the water dries up before the moin moin gets done.",
            "Arrange the Moin moin inside the Pot and cook till done. This should take about 45 minutes to 1 hour a little more or less depending on the quantity of the Moin moin mixture in each container.",
            "To check for doneness, insert a toothpick into the middle of the Moin Moin/Moi. The toothpick should come out fairly clean and not wet.",
            "Remove from heat and serve."
        ]
            }
}